/* eslint-disable */
export default function () {
  return [
    [
      {
        t: '二年级1班',
        ls: [
          {
            t: '卫生分值/等级：',
            v: '10.00/a'
          },
          {
            t: '礼仪规范分值/等级：',
            v: '9.40/a'
          },
          {
            t: '早读与晚自习分值/等级：',
            v: '9.85/a'
          },
          {
            t: '午休分值/等级：',
            v: '10.00/a'
          }
        ]
      },
      {
        t: '二年级2班',
        ls: [
          {
            t: '卫生分值/等级：',
            v: '10.00/a'
          },
          {
            t: '宿舍常规管理分值/等级：',
            v: '9.40/a'
          },
          {
            t: '考试规范管理分值/等级：',
            v: '9.85/a'
          }
        ]
      },
      {
        t: '二年级1班',
        ls: [
          {
            t: '卫生分值/等级：',
            v: '10.00/a'
          },
          {
            t: '礼仪规范分值/等级：',
            v: '9.40/a'
          },
          {
            t: '早读与晚自习分值/等级：',
            v: '9.85/a'
          },
          {
            t: '午休分值/等级：',
            v: '10.00/a'
          }
        ]
      }
    ],
    [
      {
        t: '三年级1班',
        ls: [
          {
            t: '卫生分值/等级：',
            v: '10.00/a'
          },
          {
            t: '礼仪规范分值/等级：',
            v: '9.40/a'
          },
          {
            t: '早读与晚自习分值/等级：',
            v: '9.85/a'
          },
          {
            t: '午休分值/等级：',
            v: '10.00/a'
          }
        ]
      },
      {
        t: '三年级2班',
        ls: [
          {
            t: '卫生分值/等级：',
            v: '10.00/a'
          },
          {
            t: '宿舍常规管理分值/等级：',
            v: '9.40/a'
          },
          {
            t: '考试规范管理分值/等级：',
            v: '9.85/a'
          }
        ]
      },
      {
        t: '三年级3班',
        ls: [
          {
            t: '卫生分值/等级：',
            v: '10.00/a'
          },
          {
            t: '礼仪规范分值/等级：',
            v: '9.40/a'
          },
          {
            t: '早读与晚自习分值/等级：',
            v: '9.85/a'
          },
          {
            t: '午休分值/等级：',
            v: '10.00/a'
          }
        ]
      }
    ],
    [
      {
        t: '四年级1班',
        ls: [
          {
            t: '卫生分值/等级：',
            v: '10.00/a'
          },
          {
            t: '礼仪规范分值/等级：',
            v: '9.40/a'
          },
          {
            t: '早读与晚自习分值/等级：',
            v: '9.85/a'
          },
          {
            t: '午休分值/等级：',
            v: '10.00/a'
          }
        ]
      },
      {
        t: '四年级2班',
        ls: [
          {
            t: '卫生分值/等级：',
            v: '10.00/a'
          },
          {
            t: '宿舍常规管理分值/等级：',
            v: '9.40/a'
          },
          {
            t: '考试规范管理分值/等级：',
            v: '9.85/a'
          }
        ]
      },
      {
        t: '四年级3班',
        ls: [
          {
            t: '卫生分值/等级：',
            v: '10.00/a'
          },
          {
            t: '礼仪规范分值/等级：',
            v: '9.40/a'
          },
          {
            t: '早读与晚自习分值/等级：',
            v: '9.85/a'
          },
          {
            t: '午休分值/等级：',
            v: '10.00/a'
          }
        ]
      }
    ]
  ]
}
